{
  "home": {
    "title": "Startseite",
    "firstDescription": "Hallo, <br />Ich bin <strong>Yasaman</strong>",
    "secondDescription": "Wenn Sie einen Frontend-Ingenieur suchen,<br /> der eine große Begeisterung für die Übersetzung,<br/> von UI-Konzepten hat,<br /> in optisch interessant, <br />ein gutes Gespür für die Koordination mit Design<strong> Ich bin hier. </strong>",
    "location": "Sitz in Berlin",
    "position": "Frontend Ingenieurin",
    "btnName": "Kontaktiere mich",
    "downloadResumeTooltip": "Lebenslauf herunterladen",
    "metaTooltip": "Meta Frontend-Ingenieur Zertifikat",
    "figmaTooltip": "Portfolio Figma Planen"
  },
  "aboutMe": {
    "title": "Über mich",
    "description": "<br/>Ich begann meine Reise als Testingenieur, wo ich Erfahrungen in verschiedenen Testarten wie <strong>Unit-Tests</strong>, <strong>End-to-End-Tests</strong> und <strong>Integrationstests</strong> sammelte. Diese Erfahrungen halfen mir, ein scharfes Auge für Details und ein Verständnis dafür zu entwickeln, was für Endbenutzer wichtig ist.<br/> Als ich tiefer in die Frontend-Entwicklung eintauchte, weckten <strong>React</strong> und <strong>Vue.js</strong> mein Interesse. In meiner ersten Rolle als Frontend-Entwickler habe ich über 20 Seiten für <strong>mobile</strong> und <strong>Desktop-Displays</strong> mit Vue.js, SASS, BEM und Bootstrap-Vue entwickelt. Später entwickelte ich ein Dashboard für ein Online-Zahlungsunternehmen mit <strong>React, TypeScript </strong>, Styled-Components, Tailwind und Figma. Im Laufe meiner Karriere habe ich mit zahlreichen Teams in Umgebungen zusammengearbeitet, in denen <strong>agile Methoden</strong> und <strong>Scrum</strong> zum Einsatz kamen. <br /> Um meine React-Kenntnisse zu erweitern, nahm ich am Front-End-Developer-Zertifikatsprogramm von Meta teil, das unglaublich hilfreich war und meine Kenntnisse über Figma und andere Tools vertiefte. <br/> Ich bin der festen Überzeugung, dass Tools zwar wichtig sind, dass es aber noch wichtiger ist, eine Leidenschaft für das Lernen zu entwickeln. Diese Begeisterung trägt nicht nur zum Wachstum von Unternehmen bei, sondern auch zur Entwicklung der einzelnen Entwickler."
  },
  "contactMe": {
    "title": "kontaktiere Mich",
    "mainTitle": "kontaktiere Mich",
    "phone": "+4917675408446",
    "emailNameTitle": "Ihr Name",
    "email": "info@yasaman.dev",
    "emailTitle": "E-Mail-Adresse",
    "emailSubject": "E-Mail Betreff",
    "emailMessage": "Ihre Nachricht",
    "location": "Berlin, Deutschland",
    "socialTitle": "Folgen Sie mir in den sozialen Medien:",
    "btnSubmit": "Einreichen"
  },
  "portfolio": {
    "title": "Portfolio"
  },
  "skills": {
    "title": "Fähigkeiten"
  },
  "experienceEducation": "Erfahrungen/Ausbildung",
  "experiences": {
    "title": "Arbeitserfahrungen",
    "zibal": {
      "name": "Zibal",
      "position": "Front-End Ingenieur",
      "startDate": "Juni 2022",
      "endDate": "Jetzt",
      "description": "Zibal ist ein Online-Zahlungsunternehmen, das Finanz- und Zahlungslösungen für Unternehmen jeder Größe anbietet. Im Rahmen des Dashboard-Projekts von Zibal habe ich an der Erstellung von Dashboards mitgewirkt, mit denen Endbenutzer den Status von Finanztransaktionen überwachen und Berichte erstellen können. <br/> Ich war für die Entwicklung und Pflege des Frontend-Dashboards verantwortlich und arbeitete eng mit funktionsübergreifenden Teams zusammen, um eine nahtlose Integration und eine benutzerfreundliche Oberfläche zu gewährleisten. <br/> Durch die Durchführung von Code-Reviews und Fehlerbehebungen förderte ich eine Kultur des hochwertigen Codes und der kontinuierlichen Verbesserung.<br/>Das Team bestand aus einem DevOps-Ingenieur, drei Backend-Entwicklern, einem Scrum Master und einem QA-Spezialisten.",
      "linkedinAddress": "https://www.linkedin.com/company/zibalco/",
      "websiteAddress": "https://zibal.ir",
      "logoAddress": "https://media.licdn.com/dms/image/C4D0BAQHi3aAtN3CRbQ/company-logo_200_200/0/1630576922514?e=2147483647&v=beta&t=9BXxKYTh0-HPcd5x_4O96Hqx-A-NAoOsZOLuQoSEuds",
      "skills": "React - TypeScript - Styled-component - Tailwind - GraphQL - CSS - HTML - GitHub - Figma - Scrum"
    },
    "Lastsecond": {
      "name": "Lastsecond",
      "position": "Front-End Ingenieur",
      "startDate": "Dezember 2020",
      "endDate": "March 2022",
      "description": "Ich habe als Frontend-Entwickler bei LastSecond.ir gearbeitet, einer persischen Hotel- und Flugreservierungswebsite. Zu meinen Aufgaben gehörte die Umgestaltung der Website des Unternehmens von einem veralteten Framework zu einem neuen, das Vue.js und Sass nutzte. Das Hauptziel bestand darin, ein mobiles und Desktop-freundliches Design zu schaffen. Ich musste die Hauptseiten für Touren, Hotels, Flüge, Reiserouten, Blogs, Restaurants, Videos und Attraktionen neu schreiben. <br/> Um sicherzustellen, dass das Projekt mit den Zielen übereinstimmte, arbeitete ich effektiv mit Backend-Entwicklern, UI/UX-Designern und dem Produktmanager zusammen. Dazu gehörte eine klare und konsistente Kommunikation während des gesamten Prozesses.",
      "linkedinAddress": "https://www.linkedin.com/company/lastsecond/?originalSubdomain=ir",
      "websiteAddress": "https://lastsecond.ir/",
      "logoAddress": "https://pbs.twimg.com/profile_images/1230005817832886272/raLLVHAj_400x400.jpg",
      "skills": "Vue.js - Bootstrap-Vue - Bootstrap - HTML - CSS - SASS - Linux - GitLab - Zeplin - Scrum - BEM"
    },
    "Chargoon": {
      "name": "Chargoon",
      "position": "QA Ingenieur",
      "startDate": "März 2016",
      "endDate": "April 2020",
      "description": "Während meiner Tätigkeit als manueller QA-Ingenieur bei Chargoon, einem Unternehmen, das Büroautomatisierungslösungen, Personalwesen, Finanzen und andere E-Commerce-Tools anbietet. <br/> war ich für das Testen von drei verschiedenen Plattformen verantwortlich: Die Vertrags- und Gehaltsplattform, die Organisationsplattform, und die Beschäftigungsplattform.<br/> Ich habe TFS effektiv genutzt, um Fehler zu erstellen, zu testen und mit dem Entwicklungsteam zu kommunizieren. Ich habe mit einem Team von über 10 Entwicklern, 3 Scrum Mastern und 2 Testingenieuren zusammengearbeitet, um sicherzustellen, dass die Testprozesse effizient und nahtlos waren.",
      "linkedinAddress": "https://www.linkedin.com/company/chargoon/",
      "websiteAddress": "https://www.chargoon.com/",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQacszHRS5oVtwErQ8TDlJ0LEFHT5xpi9oe6vl3ZeL_Fw&s",
      "skills": "TFS - Unit testing - End to End testing - Integration test - Scrum"
    }
  },
  "education": {
    "title": "Ausbildung",
    "coursea": {
      "name": "Meta Front-End Developer",
      "position": "Coursea",
      "startDate": "Januar 2024",
      "endDate": "Mai 2024",
      "description": "Meta Course",
      "linkedinAddress": "https://www.linkedin.com/in/yasaman-behnam-malekzadeh/details/certifications/",
      "websiteAddress": "https://www.coursera.org/account/accomplishments/specialization/certificate/697CY3FTQTKT",
      "logoAddress": "https://cdn.pixabay.com/photo/2021/12/14/22/29/meta-6871457_1280.png",
      "skills": "React - Jest - Principles of UX/UI Design - Figma - Version control - Javascript - CSS - HTML5"
    },
    "master": {
      "name": "Computersystemvernetzung und Telekommunikation",
      "position": "Meisterin",
      "startDate": "2018",
      "endDate": "2022",
      "description": "Iran University of Science and Technology",
      "linkedinAddress": "https://www.linkedin.com/company/iran-university-of-science-and-technology---iust/",
      "websiteAddress": "https://www.iust.ac.ir/en",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTS-vOLKUHqfArZL-lQREZyA7GawqfIQQD8d-U-ixSQx4wLJt8-ndf_nj5QUW9TGSeIKEo&usqp=CAU",
      "skills": ""
    },
    "bachelor": {
      "name": "Information Technology",
      "position": "Bachelor",
      "startDate": "2010",
      "endDate": "2014",
      "description": "K . N . Toosi University of Technology",
      "linkedinAddress": "https://www.linkedin.com/school/kntoosi/?originalSubdomain=ir",
      "websiteAddress": "https://en.kntu.ac.ir/",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJ1yWlcro0afcO0XN3HFcgg32ILkzRWOJejJyhOo5Zrw&s",
      "skills": ""
    }
  },
  "projects": {
    "title": "Einige einfache Projekte",
    "portfolio": {
      "name": "Portfolio",
      "description": "Meine persönliche Website, die meine Erfahrungen, Ausbildung und auch einige einfache Projekte zeigt. Es ist eine zweisprachige Website."
    },
    "applications": {
      "name": "Liste der Anwendungen",
      "description": "Eine einfache Website mit Registrierung und Anmeldung sowie Anzeige einer Liste von Anwendungen mit dem Hinzufügen, Bearbeiten und Löschen von Anwendungen."
    },
    "githubUser": {
      "name": "Liste der Github-Benutzer",
      "description": "Eine einfache Website, die eine Liste der Github-Benutzer mit Paginierung sowie eine Seite jedes Github-Benutzers mit seinen Informationen anzeigt."
    }
  },
  "public": {
    "readMoreText": "...mehr lesen",
    "showLessText": "...zeige weniger",
    "showMoreBtn": "Zeig mehr",
    "showLessBtn": "Zeige weniger"
  }
}
