{
  "home": {
    "title": "Home",
    "firstDescription": "Hi, <br />I'm <strong>Yasaman</strong>",
    "secondDescription": "If you are looking for a Frontend engineer <br /> who has a huge enthusisem for translating UI concept,<br /> into visually intresting, <br />a keen eye for coordination with design <strong>I'm here. </strong>",
    "location": "Based on Berlin",
    "position": "Frontend engineer",
    "btnName": "Contact Me",
    "downloadResumeTooltip": "Download Resume",
    "metaTooltip":"Meta Front-End developer certificate",
    "figmaTooltip":"Portfolio Figma Plan"
  },
  "aboutMe": {
    "title": "About me",
    "description": "<br />I began my journey as a test engineer, where I gained experience in various types of testing, such as <strong>unit testing</strong>, <strong>end-to-end testing</strong>, and <strong>integration testing</strong>. These experiences helped me develop a keen eye for detail and an understanding of what is important for end users. These experiences helped me develop a keen eye for details and also what is important for End users. <br />As I delved deeper into frontend development, React and Vue.js sparked my interest. In my first frontend developer role, I crafted over 20 pages for both mobile and desktop displays using Vue.js, SASS, BEM, and Bootstrap-Vue. Later, I developed a dashboard for an online payment company using <strong>React</strong>, <strong>TypeScript</strong>, Styled-Components, Tailwind, and Figma. Throughout my career, I've collaborated with numerous teams in environments that employed <strong>Agile methodologies</strong> and Scrum.<br />To expand my React skills, I participated in Meta's Front-End Developer Certificate program, which was incredibly helpful and deepened my knowledge of Figma and other tools. <br/> I firmly believe that while tools are important, maintaining a passion for learning is even more crucial. This enthusiasm not only contributes to the growth of companies but also to the development of individual developers."
  },
  "contactMe": {
    "title": "Contact me",
    "mainTitle": "Get in Touch!",
    "phone": "+4917675408446",
    "emailNameTitle": "Your name",
    "email": "info@yasaman.dev",
    "emailTitle": "Email address",
    "emailSubject": "Email subject",
    "emailMessage": "Your message",
    "location": "Berlin, Germany",
    "socialTitle": "Let's get social:",
    "btnSubmit": "Submit"
  },
  "portfolio": {
    "title": "Portfolio"
  },
  "skills": {
    "title": "Skills"
  },
  "experienceEducation": "Experiences/Educations",
  "experiences": {
    "title": "Work Experiences",
    "zibal": {
      "name": "Zibal",
      "position": "Frontend engineer",
      "startDate": "Jun 2022",
      "endDate": "Now",
      "description": "Zibal is an online payment company offering financial and payment solutions for businesses of all sizes. As part of Zibal's dashboard project, I contributed to creating dashboards that allow end users to monitor the status of financial transactions and generate reports.<br/> I was responsible for developing and maintaining the frontend dashboard, working closely with cross-functional teams to ensure seamless integration and a user-friendly interface.<br/>By conducting code reviews and troubleshooting, I promoted a culture of high-quality code and continuous improvement.<br/>The team comprised one DevOps engineer, three backend developers, one Scrum Master, and one QA specialist.",
      "linkedinAddress": "https://www.linkedin.com/company/zibalco/",
      "websiteAddress": "https://zibal.ir",
      "logoAddress": "https://media.licdn.com/dms/image/C4D0BAQHi3aAtN3CRbQ/company-logo_200_200/0/1630576922514?e=2147483647&v=beta&t=9BXxKYTh0-HPcd5x_4O96Hqx-A-NAoOsZOLuQoSEuds",
      "skills": "React - TypeScript - Styled-component - tailwind - CSS - HTML - Axios - GitHub - Figma - Scrum"
    },
    "Lastsecond": {
      "name": "Lastsecond",
      "position": "Frontend engineer",
      "startDate": "December 2020",
      "endDate": "March 2022",
      "description": "Lastsecond is a website focused on travel and tourism in Iran. I worked as a front-end developer at LastSecond.ir, a Persian hotel and flight reservation website. My responsibilities included refactoring the company's website from an outdated framework to a new one that utilized Vue.js and Sass. The main aim was to create a mobile and desktop-friendly design. I had to rewrite the main pages for tours, hotels, flights, itineraries, blogs, restaurants, videos, and attractions. <br><br>To ensure the project aligned with the objectives, I collaborated effectively with backend developers, UI/UX designers, and the product manager. This involved clear and consistent communication throughout the process.",
      "linkedinAddress": "https://www.linkedin.com/company/lastsecond/?originalSubdomain=ir",
      "websiteAddress": "https://lastsecond.ir/",
      "logoAddress": "https://pbs.twimg.com/profile_images/1230005817832886272/raLLVHAj_400x400.jpg",
      "skills": "Vue.js - Bootstrap-Vue - Bootstrap - HTML - Javasciprt - SASS - Linux - GitLab - Zeplin - Scrum"
    },
    "Chargoon": {
      "name": "Chargoon",
      "position": "QA engineer",
      "startDate": "March 2016",
      "endDate": "April 2020",
      "description": "Chargoon is a major platform in the human resources community. During my journey as a Manual QA Engineer at Chargoon, a company that offers office automation solutions, human resources, finance, and other e-commerce tools.<br/> I was responsible for testing three distinct platforms: the Contract and Salary Platform, the Organization Platform, and the Employment Platform.<br/> TFS was effectively utilized to create, test, and communicate bugs with the development team. <br/><br/> As a QA, I performed unit testing on each feature as well as end-to-end testing. <br/>Also I collaborated with a team of over 10 developers, 3 Scrum masters, and 2 test engineers to ensure that testing processes were efficient and seamless.",
      "linkedinAddress": "https://www.linkedin.com/company/chargoon/",
      "websiteAddress": "https://www.chargoon.com/",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQacszHRS5oVtwErQ8TDlJ0LEFHT5xpi9oe6vl3ZeL_Fw&s",
      "skills": "TFS - Unit testing - End to End testing - Integration test - Scrum "
    }
  },
  "education": {
    "title": "Educations",
    "coursea": {
      "name": "Meta Front-End Developer",
      "position": "Coursea",
      "startDate": "January 2024",
      "endDate": "May 2024",
      "description": "Meta Course",
      "linkedinAddress": "https://www.linkedin.com/in/yasaman-behnam-malekzadeh/details/certifications/",
      "websiteAddress": "https://www.coursera.org/account/accomplishments/specialization/certificate/697CY3FTQTKT",
      "logoAddress": "https://cdn.pixabay.com/photo/2021/12/14/22/29/meta-6871457_1280.png",
      "skills": "React - Jest - Principles of UX/UI Design - Figma - Version control - Javascript - CSS - HTML5"
    },
    "master": {
      "name": "Computer System Networking and Telecommunications",
      "position": "Master",
      "startDate": "2018",
      "endDate": "2022",
      "description": "Iran University of Science and Technology",
      "linkedinAddress": "https://www.linkedin.com/company/iran-university-of-science-and-technology---iust/",
      "websiteAddress": "https://www.iust.ac.ir/en",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTS-vOLKUHqfArZL-lQREZyA7GawqfIQQD8d-U-ixSQx4wLJt8-ndf_nj5QUW9TGSeIKEo&usqp=CAU",
      "skills": ""
    },
    "bachelor": {
      "name": "Information Technology",
      "position": "Bachelor",
      "startDate": "2010",
      "endDate": "2014",
      "description": "K . N . Toosi University of Technology",
      "linkedinAddress": "https://www.linkedin.com/school/kntoosi/?originalSubdomain=ir",
      "websiteAddress": "https://en.kntu.ac.ir/",
      "logoAddress": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJ1yWlcro0afcO0XN3HFcgg32ILkzRWOJejJyhOo5Zrw&s",
      "skills": ""
    }
  },
  "projects": {
    "title": "Some simple projects",
    "portfolio": {
      "name": "portfolio",
      "description": "My personal website which show my Experiences, Education and also some simple projects. It's a two languages website."
    },
    "applications": {
      "name": "List of Applications",
      "description": "A simple website with sign up and sign in and also show a list of applications with adding, editing and deleting application."
    },
    "githubUser": {
      "name": "List of Github users",
      "description": "A simple website which shows a list of github user with pagination and also a page of each github user with their information."
    }
  }
}
